[ID_Orchid_Battery:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="A coolant disperser for a hovercraft. This looks familiar."

[ID_Orchid_CircuitBox:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="A ''Circuit Box Deluxe 5000'' or something. This should please Scooter."

[ID_Orchid_ControlSwitch:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="This control switch looks like it once performed a very important job. The fate of Pandora may have been in the balance. We'll never know."
